# ViewerVolumeOfInterestCrop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewerVolumeOfInterestCrop Property
ParameterTypeId Class See Also
---
"Scope Box"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewerVolumeOfInterestCrop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewerVolumeOfInterestCrop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewerVolumeOfInterestCrop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace